Revit 2027 API
BuiltInFailures.SketchFailures.PathReinforcementEmptySketch Property
 Sketch is empty. Can't create Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathReinforcementEmptySketch { get; }
Public Shared ReadOnly Property PathReinforcementEmptySketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathReinforcementEmptySketch {
	FailureDefinitionId^ get ();
}
static member PathReinforcementEmptySketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace